// აპლიკაცია: კალკულატორი
// კალკულატორის ფუნქცია მომხმარებლებს საშუალებას აძლევს შეასრულონ ძირითადი არითმეტიკული
//  მოქმედებები (+, -, *, /). მომხმარებლებს შეუძლიათ შეიყვანონ ორი რიცხვი და შემდეგ აირჩიონ ოპერაცია 
// შედეგის მისაღებად. კალკულატორი ასევე შეიცავს შეყვანის ვალიდაციას არასწორი შეყვანების დასამუშავებლად.





let firstNumber;
//do-while-ის გამოყენებით, სანამ ჩაწერილი ინფორმაცია სწორი არ იქნება, გაამეორებს ქმედებას.
do {
   firstNumber = parseFloat(prompt("ჩაწერეთ პირველი რიცხი:"));

    if (isNaN(firstNumber)) {      // ვამოწმებთ შეყვანილი მონაცემი რიცხვია თუ არა.
        console.log("შეცდომა! გთხოვთ შეიყვანეთ რიცხვი");
    }
} while (isNaN(firstNumber));


let operator;
let validOperators = ['+', '-', '*', '/'];

//do-while-ის გამოყენებით, სანამ ჩაწერილი ოპერატორი სწორი არ იქნება, გაამეორებს ქმედებას.
do { 
    operator = prompt('ჩაწერეთ სასურველი ოპერატორი (+, -, *, /)');

    if (!validOperators.includes(operator)) { //თუ ValidOperators არ შეიცავს ოპერატორს, იქნება ჭეშმარიტი და შეცდომას გვიჩვენებს
        console.log("შეცდომა! გთხოვთ შეიყვანეთ ოპერატორი.");
    }
} while (!validOperators.includes(operator));



let secondNumber;
//do-while-ის გამოყენებით, სანამ ჩაწერილი ინფორმაცია რიცხვი არ იქნება, გაამეორებს ქმედებას.
do {
    secondNumber = parseFloat(prompt("ჩაწერეთ მეორე რიცხვი:"));

    if (isNaN(secondNumber)) { // ვამოწმებთ შეყვანილი მონაცემი რიცხვია თუ არა.
        console.log("შეცდომა! გთხოვთ შეიყვანეთ რიცხვი.");
    }
} while (isNaN(secondNumber));

let result;
//switch მეთოდით ვასრულებთ კალკულატორის ოპერაციას 
switch (operator) {
    case '+':
        result = firstNumber + secondNumber;
        break;
    case '-':
        result = firstNumber - secondNumber;
        break;
    case '*':
        result = firstNumber * secondNumber;
        break;
    case '/':
        // რადგან 0-ზე გაყოფა არ შეიძლება, უნდა დაგვიბრუნდეს შესაბამისი სტრიქონი
        result = secondNumber !== 0 ? firstNumber / secondNumber : 'ნულზე გაყოფა შეუძლებელია';
        break;
    default:
        console.log('არასწორია!');
        break;
}

console.log(`შედეგი: ${result}`); // 








// აპლიკაცია: Hangman
// Hangman არის სიტყვების გამოცნობის თამაში. პროგრამა ირჩევს შემთხვევით სიტყვას 
// წინასწარ განსაზღვრული სიიდან და აჩვენებს მას ქვედა ტირეების გამოყენებით (რამდენი ასოცაა სიტყვაში, იმდენი ქვედა ტირე), 
// რომელიც წარმოადგენს ფარულ ასოებს. მომხმარებლებს სთხოვენ გამოიცნონ ასო და პროგრამა 
// ამოწმებს არის თუ არა ასო სიტყვაში. ვლინდება სწორად გამოცნობილი ასოები და თამაში გრძელდება მანამ, 
// სანამ მომხმარებელი არ გამოიცნობს სიტყვას ან არ ამოიწურება მცდელობები. მცდელობების რაოდენობა იყოს 10.





// let wordList = ['სვანეთი', 'კახეთი', 'იმერეთი', 'გურია', 'აჭარა', 'სამეგრელო']; // სიტყვების ჩამონათვალი

//     // შემთხვევითობის პრინციპით მასივიდან სიტყვის ამოღება/ჩაფიქრება
//     let selectedWord = wordList[Math.floor(Math.random() * wordList.length)]; 
//     // არჩეული სიტყვის ქვედა ტირეთი დაშიფვრა 
//     let guessedWord = Array(selectedWord.length).fill('_');
//     let incorrectGuesses = []; // მასივი, სადაც შეინახება არასწორი ასოები
//     let attempts = 10; // მცდელობის რაოდენობა
    
//     // თამაში გაგრძელდეს მანამდე, სანამ მცდელობების რაოდენობა არ ამოიწურება
//     while (attempts > 0) {
//         console.log('ჩაფიქრებული სიტყვა: ' + guessedWord.join(' ')); // სიტყვის მდგომარეობის ჩვენება


//       let letter = prompt('გამოიცანი ასო:');  //ვთხოვოთ მოთამაშეს შეიყვანოს ასო


//       // თუ შეყვანილია რიცხვი, ვაცნობოთ მომხმარებელს
//       if (!isNaN(letter)) { 
//         console.log('გთხოვთ შეიყვანოთ ასო და არა რიცხვი.');
//         continue; // ხელახლა ვთხოვოთ მომხმარებელს შეიყვანოს ასო
//         }

    
//         //გამოცნობილ ასოს შეიცავს თუ არა ჩაფიქრებული სიტყვა
//       if (selectedWord.includes(letter)) {
//         // ჩაფიქრებულ სიტყვაში გამოცნობილი ასოების ჩასაწერად
//         for (let i = 0; i < selectedWord.length; i++) {
//           if (selectedWord[i] === letter) {
//             guessedWord[i] = letter;
//           }
//         }
//       } else {
//         //არასწორი ვარაუდების შემთხვევაში
//         incorrectGuesses.push(letter);
//         attempts--; // მცდელობების რაოდენობის შემცირება
//         console.log('არასწორია: ' + incorrectGuesses.join(', '));
//         console.log('დარჩენილი ცდა ' + attempts);
//       }

//       // შემოწმება, მთელი სიტყვა არის თუ არა გამოცნობილი. თუ გამოცნობილია გამოიტანოს "კონსოლში" 
//       if (!guessedWord.includes('_')) {
//         console.log('გილოცავ! შენ გამოიცანი ჩფიქრებული სიტყვა: ' + selectedWord);
//         break;
//       }
//     }
 
// // მცდელობების რაოდენობის ამოწურვის შემდეგ ვაცნობოთ მომხმარებელს თამაშის დასრულების შესახებ და ვაჩვენოთ ჩაფიქრებული სიტყვა
//     if (attempts === 0) {
//         console.log('თამაში დასრულდა! ჩაფიქრებული სიტყვა იყო: ' + selectedWord);
//     }

